In [2]:
import tensorflow as tf

# Create TensorFlow object called tensor
hello_constant = tf.constant('Hello World!')

with tf.Session() as sess:
    # Run the tf.constant operation in the session
    output = sess.run(hello_constant)
    print(output)
tf.__version__

b'Hello World!'

'1.8.0'

In [7]:
import numpy as np
np.__version__

'1.14.2'

In [8]:
import keras as ks
ks.__version__

'2.1.5'

In [10]:
m1 = np.array([[1,2,2],[3,4,5],[6,5,6]])
m2 = np.array([[6,5,4],[4,5,2],[3,5,7]])

In [11]:
print(m1.shape)

(3, 3)

In [12]:
m3 = m1 * m2
print(m3)

[[ 6 10  8]
 [12 20 10]
 [18 25 42]]

In [13]:
m4 = np.matmul(m1,m2)
print(m4)

[[20 25 22]
 [49 60 55]
 [74 85 76]]

In [19]:
m5 = np.array([[3],[4],[6]])
m6 = np.array([[6,5,7]]) 
print(m5.shape)
print(m6.shape)

m7 = np.matmul(m5, m6)
m8 = np.matmul(m6, m5)
print(m7)
print("*"*20)
print(m8)

(3, 1)
(1, 3)
[[18 15 21]
 [24 20 28]
 [36 30 42]]
********************
[[80]]

In [5]:
import pandas as pd
import numpy as np

In [6]:
pd.__version__

'0.23.0'

In [7]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [9]:
dates = pd.date_range('20180101', periods=6)
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2018-01-01 -1.153476 -0.828919 -0.102280  0.544483
2018-01-02 -0.815591  0.080838 -0.333487 -0.626852
2018-01-03  0.476738  0.932772  1.068655 -0.252469
2018-01-04  0.484153  0.561660  2.387271  1.341484
2018-01-05 -0.589729 -0.814784 -0.534398 -1.089488
2018-01-06 -0.483740 -1.038711 -0.389314  0.957078

In [11]:
df2 = pd.DataFrame({ 'A' : 1.,    
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [15]:
df2.<TAB>

SyntaxError: invalid syntax (<ipython-input-15-915637deb483>, line 1)

In [16]:
df.head()

                   A         B         C         D
2018-01-01 -1.153476 -0.828919 -0.102280  0.544483
2018-01-02 -0.815591  0.080838 -0.333487 -0.626852
2018-01-03  0.476738  0.932772  1.068655 -0.252469
2018-01-04  0.484153  0.561660  2.387271  1.341484
2018-01-05 -0.589729 -0.814784 -0.534398 -1.089488

In [17]:
df.tail(2)

                   A         B         C         D
2018-01-05 -0.589729 -0.814784 -0.534398 -1.089488
2018-01-06 -0.483740 -1.038711 -0.389314  0.957078

In [18]:
df.index

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [23]:
df.values

array([[-1.15347598, -0.82891948, -0.1022796 ,  0.54448337],
       [-0.81559099,  0.08083758, -0.33348712, -0.62685214],
       [ 0.47673816,  0.93277247,  1.06865533, -0.25246912],
       [ 0.4841526 ,  0.56166015,  2.38727148,  1.34148442],
       [-0.58972931, -0.81478374, -0.53439757, -1.08948816],
       [-0.48373961, -1.03871102, -0.38931397,  0.95707828]])

In [24]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.346941 -0.184524  0.349408  0.145706
std    0.680728  0.826761  1.154764  0.951665
min   -1.153476 -1.038711 -0.534398 -1.089488
25%   -0.759126 -0.825386 -0.375357 -0.533256
50%   -0.536734 -0.366973 -0.217883  0.146007
75%    0.236619  0.441455  0.775922  0.853930
max    0.484153  0.932772  2.387271  1.341484

In [26]:
df.T

   2018-01-01  2018-01-02  2018-01-03  2018-01-04  2018-01-05  2018-01-06
A   -1.153476   -0.815591    0.476738    0.484153   -0.589729   -0.483740
B   -0.828919    0.080838    0.932772    0.561660   -0.814784   -1.038711
C   -0.102280   -0.333487    1.068655    2.387271   -0.534398   -0.389314
D    0.544483   -0.626852   -0.252469    1.341484   -1.089488    0.957078

In [27]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2018-01-01  0.544483 -0.102280 -0.828919 -1.153476
2018-01-02 -0.626852 -0.333487  0.080838 -0.815591
2018-01-03 -0.252469  1.068655  0.932772  0.476738
2018-01-04  1.341484  2.387271  0.561660  0.484153
2018-01-05 -1.089488 -0.534398 -0.814784 -0.589729
2018-01-06  0.957078 -0.389314 -1.038711 -0.483740

2018-01-01   -1.153476
2018-01-02   -0.815591
2018-01-03    0.476738
2018-01-04    0.484153
2018-01-05   -0.589729
2018-01-06   -0.483740
Freq: D, Name: A, dtype: float64

In [28]:
df.sort_values(by='B')

                   A         B         C         D
2018-01-06 -0.483740 -1.038711 -0.389314  0.957078
2018-01-01 -1.153476 -0.828919 -0.102280  0.544483
2018-01-05 -0.589729 -0.814784 -0.534398 -1.089488
2018-01-02 -0.815591  0.080838 -0.333487 -0.626852
2018-01-04  0.484153  0.561660  2.387271  1.341484
2018-01-03  0.476738  0.932772  1.068655 -0.252469

In [30]:
df['A']

2018-01-01   -1.153476
2018-01-02   -0.815591
2018-01-03    0.476738
2018-01-04    0.484153
2018-01-05   -0.589729
2018-01-06   -0.483740
Freq: D, Name: A, dtype: float64

In [31]:

df[0:3]

                   A         B         C         D
2018-01-01 -1.153476 -0.828919 -0.102280  0.544483
2018-01-02 -0.815591  0.080838 -0.333487 -0.626852
2018-01-03  0.476738  0.932772  1.068655 -0.252469

In [35]:
df.loc[dates[0]]

A   -1.153476
B   -0.828919
C   -0.102280
D    0.544483
Name: 2018-01-01 00:00:00, dtype: float64

In [37]:
df.loc[:,['A','B']]

                   A         B
2018-01-01 -1.153476 -0.828919
2018-01-02 -0.815591  0.080838
2018-01-03  0.476738  0.932772
2018-01-04  0.484153  0.561660
2018-01-05 -0.589729 -0.814784
2018-01-06 -0.483740 -1.038711

In [39]:
df.loc['20180102':'20180104',['A','B']]

                   A         B
2018-01-02 -0.815591  0.080838
2018-01-03  0.476738  0.932772
2018-01-04  0.484153  0.561660

In [40]:
df.loc[dates[0],'A']

-1.153475977130316

In [42]:
df.iloc[3]

A    0.484153
B    0.561660
C    2.387271
D    1.341484
Name: 2018-01-04 00:00:00, dtype: float64

In [44]:
df.iloc[3:5,0:2]

                   A         B
2018-01-04  0.484153  0.561660
2018-01-05 -0.589729 -0.814784

In [46]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2018-01-02 -0.815591 -0.333487
2018-01-03  0.476738  1.068655
2018-01-05 -0.589729 -0.534398

In [47]:
df.iloc[1,1]

0.08083758164127312

In [49]:
df[df.A > 0]

                   A         B         C         D
2018-01-03  0.476738  0.932772  1.068655 -0.252469
2018-01-04  0.484153  0.561660  2.387271  1.341484

In [50]:
df[df > 0]

                   A         B         C         D
2018-01-01       NaN       NaN       NaN  0.544483
2018-01-02       NaN  0.080838       NaN       NaN
2018-01-03  0.476738  0.932772  1.068655       NaN
2018-01-04  0.484153  0.561660  2.387271  1.341484
2018-01-05       NaN       NaN       NaN       NaN
2018-01-06       NaN       NaN       NaN  0.957078